---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ElementOwnerViewFilter
source: html/b898c6a2-434b-a746-180a-f3f2d7da8ca0.htm
---
# ElementOwnerViewFilter Members

Constructs a new instance of a filter to match elements which are owned by a particular view.